#+TITLE:     Einführung in C++: Strings, Vektoren, ...
#+AUTHOR:    Thomas Hausberger, Matthias Panny @@latex:\\@@ Ursprünglich erstellt von Sebastian Stabinger
#+DATE:      SS2022

*** Beispiel 2
#+NAME: foreach_assign2
#+BEGIN_SRC C++ :includes '(<iostream> <vector>) :flags -std=c++11 :exports all
  std::vector<int> vec = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

  // Quadriert alle Einträge in arr
  for (int &i : vec) {
    i = i * i;
  }

  for (int i : vec) {
    std::cout << i << " ";
  }
#+END_SRC

#+RESULTS: foreach_assign2
: 1 4 9 16 25 36 49 64 81 100
